#-------------------------------------------------------------------------------
# Name:        less1 Task4
# v: 3.8.2
# Created:     12.06.2020
# Copyright:   (c)
#-------------------------------------------------------------------------------
'''Пользователь вводит целое положительное число.
Найдите самую большую цифру в числе.
Для решения используйте цикл while и арифметические операции. '''

user_num = input('Your number?  ')
user_num = int(user_num)

select = user_num % 10 # символ
rest = user_num // 10 # остаток

while rest > 0:
    if rest%10 > select:
        select = rest%10
    rest = rest//10
print (select)


