#-------------------------------------------------------------------------------
# Name:        less5 Task1
# v: 3.8.2
# Created:     26.06.2020
#-------------------------------------------------------------------------------
''' Создать программно файл в текстовом формате, записать в него построчно
данные, вводимые пользователем. Об окончании ввода данных свидетельствует
пустая строка. '''


string = ' '
while string != '':
    string = input('Enter string or empty to exit')
    with open ('task1.txt', 'a') as file:
        file.write(f'{string}\n')

