#-------------------------------------------------------------------------------
# Name:        less8 Task6
# v: 3.8.27
# Created:     7.07.2020
#-------------------------------------------------------------------------------
''' Продолжить работу над вторым заданием. Реализуйте механизм валидации
вводимых пользователем данных. Например, для указания количества принтеров,
отправленных на склад, нельзя использовать строковый тип данных.
Подсказка: постарайтесь по возможности реализовать в проекте «Склад оргтехники»
максимум возможностей, изученных на уроках по ООП. '''

# in les8_task4.py