#-------------------------------------------------------------------------------
# Name:        less8 Task5
# v: 3.8.27
# Created:     7.07.2020
#-------------------------------------------------------------------------------
''' Продолжить работу над первым заданием. Разработать методы, отвечающие за
приём оргтехники на склад и передачу в определенное подразделение компании.
Для хранения данных о наименовании и количестве единиц оргтехники, а также
других данных, можно использовать любую подходящую структуру, например словарь. '''

# in les8_task4.py